# InvalidConnectionsHaveBeenDisconnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..InvalidConnectionsHaveBeenDisconnected Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Invalid connections have been disconnected. Please reconnect them manually or use different fittings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidConnectionsHaveBeenDisconnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidConnectionsHaveBeenDisconnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidConnectionsHaveBeenDisconnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace